{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Query with Memory from txt File "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 85,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.embeddings.openai import OpenAIEmbeddings\n",
    "from langchain.vectorstores import Chroma\n",
    "from langchain.text_splitter import CharacterTextSplitter\n",
    "from langchain.llms import OpenAI\n",
    "from langchain.chains import ConversationalRetrievalChain"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 86,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.document_loaders import TextLoader\n",
    "loader = TextLoader(\"test_data.txt\")\n",
    "documents = loader.load()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 87,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Created a chunk of size 1049, which is longer than the specified 1000\n",
      "Created a chunk of size 1049, which is longer than the specified 1000\n"
     ]
    }
   ],
   "source": [
    "text_splitter = CharacterTextSplitter(chunk_size=1000, chunk_overlap=0)\n",
    "documents = text_splitter.split_documents(documents)\n",
    "\n",
    "embeddings = OpenAIEmbeddings()\n",
    "vectorstore = Chroma.from_documents(documents, embeddings)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.memory import ConversationBufferMemory\n",
    "memory = ConversationBufferMemory(memory_key=\"chat_history\", return_messages=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "metadata": {},
   "outputs": [],
   "source": [
    "qa = ConversationalRetrievalChain.from_llm(OpenAI(temperature=0), vectorstore.as_retriever(), memory=memory)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"From whom is the Document?\"\n",
    "result = qa({\"question\": query})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 91,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "' The document is from Linea Schmidt.'"
      ]
     },
     "execution_count": 91,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result[\"answer\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "metadata": {},
   "outputs": [],
   "source": [
    "query2 = \"Is there any information about her profession?\"\n",
    "result2 = qa({\"question\": query2})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\" I don't know.\""
      ]
     },
     "execution_count": 93,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result2[\"answer\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 94,
   "metadata": {},
   "outputs": [],
   "source": [
    "query3 = \"What is that document about then?\"\n",
    "result3 = qa({\"question\": query3})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 95,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\" I don't know.\""
      ]
     },
     "execution_count": 95,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result3[\"answer\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'question': 'What is that document about then?',\n",
       " 'chat_history': [HumanMessage(content='From whom is the Document?'),\n",
       "  AIMessage(content=' The document is from Linea Schmidt.'),\n",
       "  HumanMessage(content='Is there any information about her profession?'),\n",
       "  AIMessage(content=\" I don't know.\"),\n",
       "  HumanMessage(content='What is that document about then?'),\n",
       "  AIMessage(content=\" I don't know.\")],\n",
       " 'answer': \" I don't know.\"}"
      ]
     },
     "execution_count": 96,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result3"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Query with Memory from Web"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.document_loaders import WebBaseLoader\n",
    "\n",
    "loader = WebBaseLoader(\"https://lilianweng.github.io/posts/2023-06-23-agent/\")\n",
    "data = loader.load()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.text_splitter import RecursiveCharacterTextSplitter\n",
    "\n",
    "text_splitter = RecursiveCharacterTextSplitter(chunk_size=500, chunk_overlap=0)\n",
    "all_splits = text_splitter.split_documents(data)\n",
    "\n",
    "from langchain.embeddings import OpenAIEmbeddings\n",
    "from langchain.vectorstores import Chroma\n",
    "\n",
    "vectorstore = Chroma.from_documents(documents=all_splits, embedding=OpenAIEmbeddings())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 99,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.memory import ConversationSummaryMemory\n",
    "llm = OpenAI(temperature=0)\n",
    "memory = ConversationSummaryMemory(llm=llm,memory_key=\"chat_history\",return_messages=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.chat_models import ChatOpenAI\n",
    "from langchain.chains import ConversationalRetrievalChain\n",
    "\n",
    "retriever = vectorstore.as_retriever()\n",
    "qa = ConversationalRetrievalChain.from_llm(llm, retriever=retriever, memory=memory)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'question': 'How do agents use Task decomposition?',\n",
       " 'chat_history': [SystemMessage(content='')],\n",
       " 'answer': ' Task decomposition for agents involves breaking down large tasks into smaller, manageable subgoals, enabling efficient handling of complex tasks. The agent can also do self-criticism and self-reflection over past actions, learn from mistakes and refine them for future steps, thereby improving the quality of final results.'}"
      ]
     },
     "execution_count": 101,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qa(\"How do agents use Task decomposition?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'question': 'What are the various ways to implement memory to support it?',\n",
       " 'chat_history': [SystemMessage(content='\\nThe human asks what the AI thinks of artificial intelligence. The AI thinks artificial intelligence is a force for good because it will help humans reach their full potential. The human then asks how agents use Task decomposition, to which the AI responds that it involves breaking down large tasks into smaller, manageable subgoals, enabling efficient handling of complex tasks. The agent can also do self-criticism and self-reflection over past actions, learn from mistakes and refine them for future steps, thereby improving the quality of final results.')],\n",
       " 'answer': ' Memory can be used to store information about the task, such as the subgoals, the steps taken to achieve them, and the results of each step. This information can then be used to inform future decisions and refine the task decomposition.'}"
      ]
     },
     "execution_count": 102,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qa(\"What are the various ways to implement memory to support it?\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Query from Neo4J database "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 103,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "class Neo4jConnection:\n",
    "    def __init__(self, uri, user, pwd):\n",
    "        self._driver = GraphDatabase.driver(uri, auth=(user, pwd))\n",
    "\n",
    "    def close(self):\n",
    "        self._driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 104,
   "metadata": {},
   "outputs": [],
   "source": [
    "class Neo4jLoader:\n",
    "    def __init__(self, connection, query):\n",
    "        self.connection = connection\n",
    "        self.query = query\n",
    "\n",
    "    def load(self):\n",
    "        with self.connection._driver.session() as session:\n",
    "            results = session.run(self.query)\n",
    "            data = [record for record in results]\n",
    "        return data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 105,
   "metadata": {},
   "outputs": [],
   "source": [
    "class Neo4jService(object):\n",
    "\n",
    "    def __init__(self, uri, user, password):\n",
    "        self._driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "\n",
    "    def close(self):\n",
    "        self._driver.close()\n",
    "\n",
    "    def fetch_data(self):\n",
    "        with self._driver.session() as session:\n",
    "            return session.read_transaction(self._fetch_data_from_db)\n",
    "\n",
    "    @staticmethod\n",
    "    def _fetch_data_from_db(tx):\n",
    "        query = \"\"\"\n",
    "        MATCH (s:Study)\n",
    "        OPTIONAL MATCH (s)-[:HAS_INDICATION]->(ind:Indication)\n",
    "        OPTIONAL MATCH (s)-[:HAS_SUBINDICATION]->(sub:SubIndication)\n",
    "        OPTIONAL MATCH (s)-[relContact:HAS_CONTACT]->(con:Contact)\n",
    "        OPTIONAL MATCH (s)-[:CONDUCTED_AT]->(sc:StudyCenter)\n",
    "        OPTIONAL MATCH (s)-[:HAS_CRITERIA]->(criteria)\n",
    "        WITH s, ind, sub, \n",
    "            COLLECT(DISTINCT con.name) AS ContactNames, \n",
    "            COLLECT(DISTINCT relContact.email) AS ContactEmails,\n",
    "            COLLECT(DISTINCT sc.name) AS StudyCenterNames, \n",
    "            COLLECT(DISTINCT criteria.value) AS CriteriaValues\n",
    "        RETURN \n",
    "        s.name AS StudyName,\n",
    "        s.identifier AS Identifier,\n",
    "        ind.name AS Indication,\n",
    "        sub.name AS SubIndication,\n",
    "        ContactNames,\n",
    "        ContactEmails,\n",
    "        StudyCenterNames,\n",
    "        CriteriaValues,\n",
    "        s.embedding AS Embedding,\n",
    "        s.metadata AS Metadata\n",
    "\n",
    "        \"\"\"\n",
    "        result = tx.run(query)\n",
    "        return [{\n",
    "            \"StudyName\": record[\"StudyName\"],\n",
    "            \"Identifier\": record[\"Identifier\"],\n",
    "            \"Indication\": record[\"Indication\"],\n",
    "            \"SubIndication\": record[\"SubIndication\"],\n",
    "            \"ContactNames\": \", \".join(record[\"ContactNames\"]) if record[\"ContactNames\"] else None,  # Joining list to string\n",
    "            \"ContactEmails\": \", \".join(record[\"ContactEmails\"]) if record[\"ContactEmails\"] else None,  # Joining list to string\n",
    "            \"StudyCenterNames\": \", \".join(record[\"StudyCenterNames\"]) if record[\"StudyCenterNames\"] else None,  # Joining list to string\n",
    "            \"CriteriaValues\": \", \".join(record[\"CriteriaValues\"]) if record[\"CriteriaValues\"] else None,  # Joining list to string\n",
    "            \"Embedding\": record[\"Embedding\"],\n",
    "            \"Metadata\": record[\"Metadata\"],\n",
    "            \"SummaryText\": \" \".join([\n",
    "                f\"Study Name: {record['StudyName']}\",\n",
    "                f\"Identifier: {record['Identifier']}\",\n",
    "                f\"Indication: {record['Indication']}\",\n",
    "                f\"Sub-Indication: {record['SubIndication']}\",\n",
    "                f\"Contact Names: {', '.join(record['ContactNames']) if record['ContactNames'] else 'N/A'}\",  # Joining list to string\n",
    "                f\"Contact Emails: {', '.join(record['ContactEmails']) if record['ContactEmails'] else 'N/A'}\",  # Joining list to string\n",
    "                f\"Study Center Names: {', '.join(record['StudyCenterNames']) if record['StudyCenterNames'] else 'N/A'}\",  # Joining list to string\n",
    "                f\"Criteria Values: {', '.join(record['CriteriaValues']) if record['CriteriaValues'] else 'N/A'}\"  # Joining list to string\n",
    "            ])\n",
    "        } for record in result]\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 106,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/j0/gd9db9l10k5grhsvfgxwyll00000gn/T/ipykernel_59089/3977427155.py:11: DeprecationWarning: read_transaction has been renamed to execute_read\n",
      "  return session.read_transaction(self._fetch_data_from_db)\n"
     ]
    }
   ],
   "source": [
    "# Use your Neo4j credentials here\n",
    "neo_service = Neo4jService(uri=\"bolt://localhost:7687\", user=\"neo4j\", password=\"password\")\n",
    "data = neo_service.fetch_data()\n",
    "neo_service.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 107,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'StudyName': 'Safety, Adherence and Persistence in a Real-World Cohort of German MS Patients Newly Treated With Ocrelizumab (CONFIDENCE)',\n",
       " 'Identifier': 'STUDYMATCH-9c5807da-eb1b-49f9-84c6-f7715083685a',\n",
       " 'Indication': 'Multiple Sclerosis',\n",
       " 'SubIndication': 'UNKNOWN_VALUE',\n",
       " 'ContactNames': ' Marcia Gasis, Marc Pawlitzki',\n",
       " 'ContactEmails': 'UNKNOWN_VALUE, marcguenter.pawlitzki@med.uni-duesseldorf.de',\n",
       " 'StudyCenterNames': 'University Clinic Düsseldorf',\n",
       " 'CriteriaValues': None,\n",
       " 'Embedding': [-0.009933089107644977,\n",
       "  -0.003986260468925026,\n",
       "  0.004819159028108939,\n",
       "  -0.03246591306038755,\n",
       "  0.005545802992599137,\n",
       "  0.029010926030592386,\n",
       "  -0.013600585326827565,\n",
       "  -0.00377032354673218,\n",
       "  -0.02171706266060186,\n",
       "  -0.014903060462950292,\n",
       "  0.02055169124876032,\n",
       "  0.0003624651945629001,\n",
       "  -0.0013110443517209483,\n",
       "  0.017987870044889515,\n",
       "  -0.015780518151620754,\n",
       "  0.02249854848733357,\n",
       "  0.05023441938160139,\n",
       "  0.007053932783821047,\n",
       "  -0.011921077277238066,\n",
       "  -0.013909066378153747,\n",
       "  -0.03394662285181129,\n",
       "  0.004061666865353862,\n",
       "  -0.03257559678487057,\n",
       "  -0.008754005833259169,\n",
       "  -0.019907309146309792,\n",
       "  -0.01693218049488581,\n",
       "  0.0038320197104312866,\n",
       "  -0.028023787411406677,\n",
       "  -0.002800322194589676,\n",
       "  -0.004270748321935871,\n",
       "  0.004332444718465626,\n",
       "  -0.017549142597538172,\n",
       "  0.0033435915343852643,\n",
       "  0.0018388895923840977,\n",
       "  -0.013093305086013038,\n",
       "  -0.022704203142432752,\n",
       "  -0.0013281822008407722,\n",
       "  0.002692353733493253,\n",
       "  0.013312669741011302,\n",
       "  0.004325589252854789,\n",
       "  0.020990418696111658,\n",
       "  0.002435286345941867,\n",
       "  -0.008788281298668169,\n",
       "  0.007705170351882409,\n",
       "  -0.002625516203416667,\n",
       "  0.014505463015296193,\n",
       "  -0.00783541814489146,\n",
       "  -0.002891152690150951,\n",
       "  -0.030080326511817766,\n",
       "  0.03350789540445995,\n",
       "  0.018454019354684208,\n",
       "  0.00783541814489146,\n",
       "  -0.009727434452545794,\n",
       "  0.011598886226012803,\n",
       "  -6.7915363174578844e-06,\n",
       "  -0.024980107829164697,\n",
       "  0.019358897974475427,\n",
       "  0.03498860147059332,\n",
       "  -0.004880855424638693,\n",
       "  -0.022128371970800226,\n",
       "  0.003067672314896021,\n",
       "  0.0008860260311537557,\n",
       "  -0.01982504728427012,\n",
       "  -0.0016332356357768594,\n",
       "  0.001229639655713278,\n",
       "  0.013723978119887075,\n",
       "  -0.022087241039780388,\n",
       "  0.0051002196139756616,\n",
       "  0.009953654573154896,\n",
       "  0.0011370952937492936,\n",
       "  0.036743514985289064,\n",
       "  0.021840455453661367,\n",
       "  -0.00837011838550415,\n",
       "  -0.011927932742848903,\n",
       "  0.04751978538487291,\n",
       "  -0.004089087330813321,\n",
       "  -0.020277485662843136,\n",
       "  -0.011783974484279475,\n",
       "  0.013202987879173466,\n",
       "  0.011379521571014538,\n",
       "  0.014861929531930454,\n",
       "  -0.013353800672031138,\n",
       "  -0.008795136764279005,\n",
       "  0.01841288842366437,\n",
       "  0.012510619380092267,\n",
       "  0.019427448905293427,\n",
       "  -0.005977676371323532,\n",
       "  0.018385468423866208,\n",
       "  -0.021854166384883043,\n",
       "  -0.009261286074073696,\n",
       "  0.02925770975406622,\n",
       "  0.025734171793453057,\n",
       "  0.0036332207537735886,\n",
       "  0.001570682538876398,\n",
       "  0.007993085472037377,\n",
       "  0.014478042084175437,\n",
       "  0.025089789691002534,\n",
       "  0.03452245216079863,\n",
       "  -0.015190976048766555,\n",
       "  -0.011489204364174967,\n",
       "  -0.008548352109482578,\n",
       "  0.022073530108558715,\n",
       "  -0.01979762542182677,\n",
       "  -0.024459116657128493,\n",
       "  -0.039842036429772555,\n",
       "  -0.013059029620604038,\n",
       "  -0.010988779588971277,\n",
       "  -0.0007489233546104888,\n",
       "  0.011304115174585702,\n",
       "  -0.02843509485895986,\n",
       "  0.005370997467087425,\n",
       "  0.03235622933590452,\n",
       "  -0.01593133094447843,\n",
       "  -0.015245816979685472,\n",
       "  -0.010837966796113605,\n",
       "  -0.009830261780095386,\n",
       "  -0.0018817341569759955,\n",
       "  0.0010882524295785618,\n",
       "  3.0392877923090802e-05,\n",
       "  -0.011413797967746131,\n",
       "  -4.4585148311508325e-05,\n",
       "  0.035153125194672674,\n",
       "  -0.0018954445061210492,\n",
       "  -0.03682577684732874,\n",
       "  0.010296411089890076,\n",
       "  0.02997064464997993,\n",
       "  -0.02340342710712479,\n",
       "  -0.020181512869581787,\n",
       "  0.009124183281115104,\n",
       "  0.0029871245520897054,\n",
       "  0.0017840485450498558,\n",
       "  -0.0036435034865285477,\n",
       "  0.016109563737134264,\n",
       "  -0.015300658841926985,\n",
       "  -0.00014545736780284025,\n",
       "  0.013963907309072664,\n",
       "  -0.005405272932496425,\n",
       "  -0.004390712916528665,\n",
       "  -0.02478816410528719,\n",
       "  -0.013737688119786156,\n",
       "  0.005559513458159515,\n",
       "  0.03759355174283877,\n",
       "  0.005724036716577566,\n",
       "  0.010927083192441522,\n",
       "  0.012784824034686856,\n",
       "  -0.005775450380352361,\n",
       "  0.011262984243565866,\n",
       "  0.006885981792597578,\n",
       "  -0.02014038193856195,\n",
       "  -0.014382070222236682,\n",
       "  0.009741145383767469,\n",
       "  -0.037154824295487436,\n",
       "  0.005425838398006343,\n",
       "  0.00665976260331107,\n",
       "  0.004712904433415225,\n",
       "  0.008445524781932987,\n",
       "  0.017178964218359644,\n",
       "  0.02732456344671464,\n",
       "  -0.030519055821814293,\n",
       "  -0.02152511893672435,\n",
       "  -0.016534582115909118,\n",
       "  -0.010591181209994584,\n",
       "  -0.008726584902138413,\n",
       "  0.011071040519688357,\n",
       "  0.008973370488257432,\n",
       "  0.007951955472340132,\n",
       "  0.014135285567440255,\n",
       "  -0.02337600524468144,\n",
       "  -0.0012347809056754333,\n",
       "  0.00668375533596511,\n",
       "  -0.018371757492644532,\n",
       "  0.02415749107141315,\n",
       "  -0.010433513882848668,\n",
       "  0.033288527955493905,\n",
       "  -0.007485806162545442,\n",
       "  0.013381220671829301,\n",
       "  0.0018543136915165365,\n",
       "  0.004712904433415225,\n",
       "  -0.013867935447133911,\n",
       "  -0.022402577556717408,\n",
       "  -0.0032236267069618214,\n",
       "  0.021196073351210844,\n",
       "  0.03024485023589711,\n",
       "  -0.0024215758803814895,\n",
       "  -0.015067584187029638,\n",
       "  0.01931776704345559,\n",
       "  0.027036646929575785,\n",
       "  0.0027763292291049873,\n",
       "  -0.005576651190864015,\n",
       "  0.011084751450910032,\n",
       "  0.010577471210095503,\n",
       "  0.013182422413663549,\n",
       "  -0.0012896220694249994,\n",
       "  -0.017028151425501972,\n",
       "  -0.6203621751767548,\n",
       "  -0.026776152274880276,\n",
       "  0.00583714631122082,\n",
       "  0.010282700158668402,\n",
       "  0.009837117245706224,\n",
       "  0.03235622933590452,\n",
       "  0.021977559177942554,\n",
       "  0.021374306143866678,\n",
       "  -0.018371757492644532,\n",
       "  0.03663383498609642,\n",
       "  -0.0027591912635698394,\n",
       "  0.03298690236977856,\n",
       "  -0.0012887651362236447,\n",
       "  0.007410399766116606,\n",
       "  -0.003499545693620416,\n",
       "  -0.018193524699988698,\n",
       "  -0.00395883953780427,\n",
       "  -0.018303206561826536,\n",
       "  0.012702563103969776,\n",
       "  0.007149904645759801,\n",
       "  -0.021607380798764023,\n",
       "  0.01058432667570634,\n",
       "  -0.016260376529991936,\n",
       "  0.019029850526316734,\n",
       "  0.0023753038158148216,\n",
       "  0.018824197733862735,\n",
       "  -0.003975977736170066,\n",
       "  -0.03830648663875249,\n",
       "  -0.00205311253175891,\n",
       "  0.022087241039780388,\n",
       "  -0.037867759191401146,\n",
       "  0.008034216403057213,\n",
       "  0.00017362767891731552,\n",
       "  0.009247575142852021,\n",
       "  0.051002194277111425,\n",
       "  -0.02746166530835064,\n",
       "  -0.001847458575151672,\n",
       "  0.0017026438490421855,\n",
       "  0.014793378601112456,\n",
       "  0.03836132663834881,\n",
       "  -0.0028585908583140126,\n",
       "  -0.01934518704325375,\n",
       "  0.020592822179780153,\n",
       "  -0.004078804598058362,\n",
       "  -0.010406092951727912,\n",
       "  0.014066734636622258,\n",
       "  0.01390221091254291,\n",
       "  0.005347004268772088,\n",
       "  0.00906248688458535,\n",
       "  0.006947678189127333,\n",
       "  0.03298690236977856,\n",
       "  0.009741145383767469,\n",
       "  -0.016150694668154098,\n",
       "  -0.019975860077127792,\n",
       "  0.013449772533969893,\n",
       "  0.009089906884383513,\n",
       "  0.021004129627333334,\n",
       "  -0.0012433498884430072,\n",
       "  0.020976709627535173,\n",
       "  0.009700014452747633,\n",
       "  -0.028037496479983166,\n",
       "  0.005484107061730679,\n",
       "  -0.012723128569479695,\n",
       "  -0.03671609684813609,\n",
       "  -0.026913254136516275,\n",
       "  -0.0017891899114273354,\n",
       "  -0.00583714631122082,\n",
       "  0.016068432806114426,\n",
       "  0.015300658841926985,\n",
       "  -0.014478042084175437,\n",
       "  0.02500752782896286,\n",
       "  0.009412098866931368,\n",
       "  0.00010084544396676849,\n",
       "  -0.020867027765697335,\n",
       "  0.027571347170188474,\n",
       "  0.01775479538999217,\n",
       "  0.014190126498359174,\n",
       "  0.001948571803467906,\n",
       "  -0.008870543160707841,\n",
       "  0.011454927967443374,\n",
       "  -0.009501215263259286,\n",
       "  -0.0033401638015798456,\n",
       "  0.007314427438516555,\n",
       "  0.01300418868968512,\n",
       "  -0.0011542331428691175,\n",
       "  -0.01333323520652122,\n",
       "  -0.018015291907332864,\n",
       "  0.012373516587133676,\n",
       "  -0.006546652543006519,\n",
       "  -0.013950197309173584,\n",
       "  0.008157609196116723,\n",
       "  0.007170469645608423,\n",
       "  0.001423297129578172,\n",
       "  -0.039842036429772555,\n",
       "  0.016123274668355937,\n",
       "  0.03186266188895686,\n",
       "  -0.005881704509384778,\n",
       "  -0.00823301559254556,\n",
       "  0.015355499772845902,\n",
       "  -0.02386957641691948,\n",
       "  -0.007300717438617473,\n",
       "  0.004863717226272897,\n",
       "  0.02713261972283713,\n",
       "  0.010728284002953175,\n",
       "  0.020921867765293662,\n",
       "  -0.014176416498460092,\n",
       "  -0.025898695517532405,\n",
       "  0.006954533189076874,\n",
       "  0.034001462851407614,\n",
       "  -0.019029850526316734,\n",
       "  -0.004959689088211651,\n",
       "  0.008459234781832067,\n",
       "  -0.018029000975909353,\n",
       "  -0.020003280076925953,\n",
       "  -0.0013993041640934832,\n",
       "  -0.031506196303645186,\n",
       "  0.011249274243666785,\n",
       "  -0.002635798936171626,\n",
       "  -0.0018954445061210492,\n",
       "  -0.041788895530990994,\n",
       "  0.0196468126289691,\n",
       "  -0.009775420849176469,\n",
       "  -0.012777969500398612,\n",
       "  0.01647974211631279,\n",
       "  -0.0026717882679833348,\n",
       "  0.0024198622468094284,\n",
       "  0.003736047848492532,\n",
       "  -0.006080503698873124,\n",
       "  0.04658749049057391,\n",
       "  -0.01118757784713703,\n",
       "  0.021100102420594683,\n",
       "  -0.007862838144689622,\n",
       "  0.021470278937128027,\n",
       "  -0.008877397694996085,\n",
       "  0.005768594914741524,\n",
       "  0.018029000975909353,\n",
       "  0.028215731135284187,\n",
       "  -0.003523538659105105,\n",
       "  0.01229811019070484,\n",
       "  -0.027598769032631823,\n",
       "  -0.015437760703562982,\n",
       "  -0.005669195785658648,\n",
       "  0.016973311425905645,\n",
       "  -0.008308421988974395,\n",
       "  -0.006673472603210151,\n",
       "  -0.024897845967125024,\n",
       "  -0.00128448070304752,\n",
       "  0.024623640381207842,\n",
       "  -0.007897113610098622,\n",
       "  -0.022759043142029076,\n",
       "  0.00885683316080876,\n",
       "  -0.01741203887325699,\n",
       "  0.006694038068720069,\n",
       "  0.02824315113508235,\n",
       "  -0.002591240505177019,\n",
       "  -0.02646081575794326,\n",
       "  -0.0256382008628369,\n",
       "  -0.03518054705711602,\n",
       "  0.00025578216237234015,\n",
       "  -0.010803690399382011,\n",
       "  -0.0004271605080514239,\n",
       "  0.02805120741120484,\n",
       "  -0.010851676796012686,\n",
       "  -0.018879037733459062,\n",
       "  0.0068208581289237015,\n",
       "  -0.005926263173210033,\n",
       "  -0.00026649333262414565,\n",
       "  0.02661162855080093,\n",
       "  -0.01369655718876632,\n",
       "  -0.05144092172446277,\n",
       "  0.003688061917523155,\n",
       "  -0.03123198885508282,\n",
       "  -0.01320984241346171,\n",
       "  0.010680298537645095,\n",
       "  0.013826804516114073,\n",
       "  0.0013984472308921287,\n",
       "  -0.03112230699324498,\n",
       "  -0.009453229797951206,\n",
       "  0.012723128569479695,\n",
       "  0.014875640463152128,\n",
       "  0.015328078841725146,\n",
       "  0.012805389500196775,\n",
       "  0.012558604845400348,\n",
       "  -0.004490112511272838,\n",
       "  0.03147877444120184,\n",
       "  -0.014820799532233211,\n",
       "  0.017795926321012005,\n",
       "  0.006947678189127333,\n",
       "  0.01220899286305433,\n",
       "  0.038471010362831834,\n",
       "  0.0024952686432382644,\n",
       "  -0.0040171082015286064,\n",
       "  -0.020812185903455824,\n",
       "  0.02768102903202631,\n",
       "  -0.00171206964859579,\n",
       "  -0.009398387935709693,\n",
       "  -0.01576680722039908,\n",
       "  0.01255174937978951,\n",
       "  0.0147659576699917,\n",
       "  0.015849069082438754,\n",
       "  0.0391565233963022,\n",
       "  -0.023321165245085117,\n",
       "  0.020277485662843136,\n",
       "  0.008123333730707723,\n",
       "  0.027310852515492968,\n",
       "  -0.00445240931305842,\n",
       "  -0.007636618955403114,\n",
       "  -0.03342563354242028,\n",
       "  0.04549066814690518,\n",
       "  0.00704707731821021,\n",
       "  -0.001979419768902135,\n",
       "  -0.01841288842366437,\n",
       "  -0.009891958176625141,\n",
       "  0.001406159280458348,\n",
       "  -0.010077046434891813,\n",
       "  0.02237515569427406,\n",
       "  0.018289497493250047,\n",
       "  -0.0037874612794366797,\n",
       "  -0.01143436343325605,\n",
       "  0.0002761333654780888,\n",
       "  -0.0005681191802739695,\n",
       "  0.010063336434992732,\n",
       "  0.025501097138555712,\n",
       "  -0.010899662261320766,\n",
       "  0.00861004757468974,\n",
       "  0.010502064813666667,\n",
       "  0.02914802789222838,\n",
       "  0.033288527955493905,\n",
       "  0.043077659735892046,\n",
       "  0.001433579862333131,\n",
       "  -0.011406942502135293,\n",
       "  0.0016032443707133365,\n",
       "  0.028928664168552713,\n",
       "  -0.002462706811401326,\n",
       "  0.021127522420392845,\n",
       "  0.002874014724615803,\n",
       "  0.019482290767534938,\n",
       "  -0.03213686561222885,\n",
       "  0.003196206008671714,\n",
       "  -0.02131946614427035,\n",
       "  0.011804539949789392,\n",
       "  0.032685276784063216,\n",
       "  0.0026615057680590237,\n",
       "  -0.004754035364435061,\n",
       "  0.022347735694475897,\n",
       "  -0.026995515998555947,\n",
       "  0.012969913224276122,\n",
       "  0.028215731135284187,\n",
       "  0.028599618583039204,\n",
       "  -0.0031259409786203573,\n",
       "  -0.0020753916308408897,\n",
       "  0.007300717438617473,\n",
       "  -0.00821245012703564,\n",
       "  -0.01462885487703311,\n",
       "  -0.02077105497243599,\n",
       "  -0.0033093158361456165,\n",
       "  -0.009569766194077284,\n",
       "  0.0024489965786715965,\n",
       "  0.032411073060791225,\n",
       "  0.026652759481820765,\n",
       "  0.03317884795630126,\n",
       "  0.03792259919099747,\n",
       "  -0.007732590817341869,\n",
       "  0.005329866536067588,\n",
       "  0.008411249316523987,\n",
       "  -0.0025518234405598915,\n",
       "  -0.010316976555399995,\n",
       "  -0.030080326511817766,\n",
       "  -0.004109652796323239,\n",
       "  -0.030135168374059277,\n",
       "  -0.012407792052542676,\n",
       "  -0.017069282356521807,\n",
       "  0.006957960921882292,\n",
       "  -0.008637468505810495,\n",
       "  -0.019495999836111423,\n",
       "  0.0026717882679833348,\n",
       "  -0.006443825681118224,\n",
       "  0.03175297816447383,\n",
       "  0.02079847497223415,\n",
       "  0.02648823575774142,\n",
       "  -0.008822556764077167,\n",
       "  -0.03973235643057991,\n",
       "  0.020071831007743953,\n",
       "  0.021936428246922716,\n",
       "  -0.009096762349994349,\n",
       "  0.0021645084928301034,\n",
       "  -0.019304056112233917,\n",
       "  -0.005501244794435179,\n",
       "  -0.021470278937128027,\n",
       "  -0.012510619380092267,\n",
       "  0.004167921460047575,\n",
       "  0.02149769893692619,\n",
       "  -0.02434943479529066,\n",
       "  -0.000980284084897463,\n",
       "  -0.0029785556857374555,\n",
       "  -0.024253463864674498,\n",
       "  0.03337078981753358,\n",
       "  -0.03295948423262558,\n",
       "  0.0030282552502788936,\n",
       "  -0.008294711989075314,\n",
       "  0.014409491153357438,\n",
       "  -0.022142081039376715,\n",
       "  -0.005549230725404556,\n",
       "  0.004514105709588176,\n",
       "  -0.006358136551934428,\n",
       "  0.0009168741130033091,\n",
       "  0.006128489629842502,\n",
       "  -0.040198505740374604,\n",
       "  -0.019112112388356407,\n",
       "  -0.01727493701162099,\n",
       "  0.003173926909589735,\n",
       "  -0.014080444636521338,\n",
       "  -0.01501274325611072,\n",
       "  0.0046237875714260105,\n",
       "  0.010831111330502767,\n",
       "  0.018166104700190536,\n",
       "  -0.01022100469346124,\n",
       "  -0.016013592806518102,\n",
       "  0.028215731135284187,\n",
       "  -0.027872972755903818,\n",
       "  0.007595488024383278,\n",
       "  -0.008308421988974395,\n",
       "  0.0043975683821395025,\n",
       "  -0.008658033971320414,\n",
       "  0.018495150285704042,\n",
       "  0.0150950041868278,\n",
       "  0.008500365712851904,\n",
       "  0.018454019354684208,\n",
       "  0.024911555035701513,\n",
       "  0.023389716175903113,\n",
       "  -0.023787314554879806,\n",
       "  -0.012791679500297692,\n",
       "  -0.0024130070140292396,\n",
       "  0.017082993287743483,\n",
       "  -0.019331477974677266,\n",
       "  0.0029974072848446645,\n",
       "  -0.00048200158448949686,\n",
       "  0.009151603280913268,\n",
       "  0.02242999755651557,\n",
       "  0.001143093593328128,\n",
       "  0.022046110108760553,\n",
       "  -0.010104467366012568,\n",
       "  -0.0006970813988580019,\n",
       "  0.01072142946866493,\n",
       "  0.019674234491412448,\n",
       "  0.009247575142852021,\n",
       "  0.024363145726512332,\n",
       "  0.042556670426501034,\n",
       "  0.01091337319254244,\n",
       "  -0.005466969329026179,\n",
       "  0.01373083265417532,\n",
       "  0.031643298165281185,\n",
       "  0.0068174303961182825,\n",
       "  -0.010111321900300813,\n",
       "  0.0066117766723416925,\n",
       "  0.01678136770202814,\n",
       "  -0.01094764865795144,\n",
       "  0.026364844827327098,\n",
       "  0.0030608173149464803,\n",
       "  -0.032027185613036205,\n",
       "  0.010837966796113605,\n",
       "  -0.003989687736069148,\n",
       "  -0.018673384941005063,\n",
       "  0.0017566279631750729,\n",
       "  0.020277485662843136,\n",
       "  0.030464213959572783,\n",
       "  -0.009076196884484432,\n",
       "  -0.014601434877234946,\n",
       "  -0.0011156730114533448,\n",
       "  -0.03024485023589711,\n",
       "  0.00409937006356828,\n",
       "  0.013456627068258138,\n",
       "  -0.00633071608647497,\n",
       "  -0.029202869754469892,\n",
       "  0.012647721241728265,\n",
       "  -0.017082993287743483,\n",
       "  -0.02070250404161799,\n",
       "  -0.025048658759982696,\n",
       "  -0.008267291057954559,\n",
       "  0.010495209348055829,\n",
       "  -0.02374618362385997,\n",
       "  -0.027064068792019134,\n",
       "  -0.0017154972649858844,\n",
       "  -0.008808846764178086,\n",
       "  -0.03679835871017576,\n",
       "  -0.04710847979996492,\n",
       "  0.019180663319174406,\n",
       "  -0.011715423553461475,\n",
       "  -0.05231838034445583,\n",
       "  -0.012195282863155249,\n",
       "  -0.006210751026220878,\n",
       "  -0.018933879595700573,\n",
       "  -0.03156103630324151,\n",
       "  0.002294756053008506,\n",
       "  0.006464391146628142,\n",
       "  -0.03021743023609895,\n",
       "  -0.021950137315499205,\n",
       "  0.02131946614427035,\n",
       "  0.007108773714739965,\n",
       "  0.010906517726931603,\n",
       "  0.017919319114071516,\n",
       "  0.002846594259156344,\n",
       "  0.00631357835377047,\n",
       "  0.006625486672240773,\n",
       "  -0.0019434304370904263,\n",
       "  0.017124124218763317,\n",
       "  0.004678628968006225,\n",
       "  -0.01941373797407175,\n",
       "  0.004565518907701674,\n",
       "  -0.0016212391530345152,\n",
       "  0.020044411007945788,\n",
       "  -0.009898812710913385,\n",
       "  -0.011125882381929868,\n",
       "  0.03545475078038802,\n",
       "  0.005861139509536157,\n",
       "  0.0009905668176524221,\n",
       "  -0.013758253585296075,\n",
       "  0.0030282552502788936,\n",
       "  -0.018015291907332864,\n",
       "  0.0025244029751004325,\n",
       "  0.0018354620924093275,\n",
       "  0.030327112097936787,\n",
       "  -0.01938631797427359,\n",
       "  -0.01099563412325952,\n",
       "  0.00044686904035998756,\n",
       "  -0.02950449534018524,\n",
       "  0.0004511534735361125,\n",
       "  -0.005480679328925261,\n",
       "  0.013436061602748219,\n",
       "  0.010029060969583732,\n",
       "  -0.006289585155455133,\n",
       "  -0.009028211419176351,\n",
       "  -0.0062690196899452145,\n",
       "  -0.00409937006356828,\n",
       "  -0.006635769404995733,\n",
       "  -0.004065094132497984,\n",
       "  -0.022443708487737246,\n",
       "  -0.01218842739754441,\n",
       "  0.0019331477043354672,\n",
       "  -0.008157609196116723,\n",
       "  -0.012496908448870593,\n",
       "  0.024938976898144862,\n",
       "  0.04288571787465972,\n",
       "  -0.003907426339690771,\n",
       "  -0.02925770975406622,\n",
       "  0.006097641431577624,\n",
       "  0.036112845676705405,\n",
       "  0.0017549142131876876,\n",
       "  0.0008988793888897927,\n",
       "  0.015273237910806228,\n",
       "  0.0018937306397183399,\n",
       "  0.008171319196015804,\n",
       "  -0.04354380904568674,\n",
       "  -0.012681997638459858,\n",
       "  0.010680298537645095,\n",
       "  0.02386957641691948,\n",
       "  -0.016054723737537937,\n",
       "  -0.04055497132568627,\n",
       "  -0.0056109271219343115,\n",
       "  -0.007002519120046251,\n",
       "  -0.016191825599173936,\n",
       "  0.0016872197499097467,\n",
       "  -0.0003586091697797904,\n",
       "  -0.014190126498359174,\n",
       "  -0.00024485681702785813,\n",
       "  -0.013991328240193422,\n",
       "  -0.003213343974206862,\n",
       "  0.014724826738971863,\n",
       "  0.03038195209753311,\n",
       "  -0.022073530108558715,\n",
       "  -0.0019177236052030284,\n",
       "  0.012147296466524574,\n",
       "  0.004716332166220643,\n",
       "  0.024911555035701513,\n",
       "  0.013346945206420302,\n",
       "  -0.026159190172227915,\n",
       "  -0.014957901393869209,\n",
       "  -0.0020822468636210786,\n",
       "  -0.017768506321213844,\n",
       "  0.0021627946264273943,\n",
       "  -0.01780963725223368,\n",
       "  -0.03274011678365954,\n",
       "  0.038964581535069875,\n",
       "  0.026872123205496437,\n",
       "  0.0432421834599714,\n",
       "  0.0032990331033906574,\n",
       "  0.0032664712715537187,\n",
       "  0.0012287827225119232,\n",
       "  -0.00395883953780427,\n",
       "  0.0026597919016563146,\n",
       "  -0.004277603321885411,\n",
       "  -0.007307572438567014,\n",
       "  0.0024489965786715965,\n",
       "  -0.00843866931632215,\n",
       "  -0.02129204614447219,\n",
       "  0.00030398232664205607,\n",
       "  0.031149726993043147,\n",
       "  -0.029833542788343933,\n",
       "  0.0032082026078293826,\n",
       "  -0.0001429938012642698,\n",
       "  -0.01742574980447866,\n",
       "  -0.006584355741220937,\n",
       "  -0.020428298455700808,\n",
       "  -0.04082917504895826,\n",
       "  -0.015506312565703574,\n",
       "  0.020058121939167464,\n",
       "  -0.01693218049488581,\n",
       "  0.021278335213250517,\n",
       "  -0.0195782616981511,\n",
       "  -0.013470337999479812,\n",
       "  -0.00880199129856725,\n",
       "  -0.007897113610098622,\n",
       "  0.0025843855052274786,\n",
       "  -0.0030076900175996235,\n",
       "  0.0295319153399834,\n",
       "  -0.014779668601213375,\n",
       "  0.003660641452063696,\n",
       "  -0.005257887406782874,\n",
       "  -0.004455837045863839,\n",
       "  -0.0195782616981511,\n",
       "  -0.006639197137801151,\n",
       "  -0.012579170310910265,\n",
       "  -0.022087241039780388,\n",
       "  0.03298690236977856,\n",
       "  0.01649345118488928,\n",
       "  0.012065035535807494,\n",
       "  0.022690492211211076,\n",
       "  -0.003742903081272721,\n",
       "  -0.018920168664478897,\n",
       "  0.009274996073972776,\n",
       "  -0.006903119525302078,\n",
       "  -0.020949287765091824,\n",
       "  -0.014642565808254784,\n",
       "  -0.033288527955493905,\n",
       "  0.012483198448971512,\n",
       "  -0.007787431748260787,\n",
       "  -0.0036400759865537775,\n",
       "  -0.00808905733397613,\n",
       "  -0.008637468505810495,\n",
       "  0.004558663907752134,\n",
       "  -0.017480591666720176,\n",
       "  0.029477075340387075,\n",
       "  -0.010968214123461358,\n",
       "  -0.018687094009581552,\n",
       "  0.003148220077702337,\n",
       "  -0.013785673585094237,\n",
       "  0.037867759191401146,\n",
       "  -0.017357198873660665,\n",
       "  0.019112112388356407,\n",
       "  0.01839917935508788,\n",
       "  0.005840574044026238,\n",
       "  -0.008027361868768968,\n",
       "  0.0018834480233787048,\n",
       "  -0.01722009514937948,\n",
       "  -0.017891899114273354,\n",
       "  0.035070863332633,\n",
       "  0.05231838034445583,\n",
       "  -0.010282700158668402,\n",
       "  -0.019811336353048443,\n",
       "  0.00596739410422987,\n",
       "  -0.0018354620924093275,\n",
       "  -0.02515834062182053,\n",
       "  -0.05407329385915157,\n",
       "  0.04869886959058132,\n",
       "  0.028764140444473365,\n",
       "  0.00308652391400323,\n",
       "  -0.03814196291467314,\n",
       "  -0.01722009514937948,\n",
       "  -0.027118908791615458,\n",
       "  0.006293012888260552,\n",
       "  -0.016315218392233446,\n",
       "  -0.0009674307271614262,\n",
       "  -0.0024232897467841986,\n",
       "  -0.0019999852344120533,\n",
       "  -0.007705170351882409,\n",
       "  0.01931776704345559,\n",
       "  -0.02256709941815157,\n",
       "  -0.004555236174946715,\n",
       "  -0.007513226628004901,\n",
       "  -0.030107746511615928,\n",
       "  -0.006604921206730855,\n",
       "  -0.005261315139588293,\n",
       "  -0.0007339277802863894,\n",
       "  -0.0166716858401903,\n",
       "  -0.0012287827225119232,\n",
       "  0.02633742296488375,\n",
       "  0.008706019436628494,\n",
       "  -0.03062873768365213,\n",
       "  0.02525431341508188,\n",
       "  -0.024020389209777154,\n",
       "  0.02248483941875708,\n",
       "  -0.009227009677342104,\n",
       "  -0.01085853133030093,\n",
       "  0.037620973605282125,\n",
       "  0.007108773714739965,\n",
       "  0.00206168139811116,\n",
       "  -0.001271627287103821,\n",
       "  -0.0029082904228554507,\n",
       "  -0.008363262919893312,\n",
       "  0.015520022565602655,\n",
       "  0.0049836822865269885,\n",
       "  -0.014382070222236682,\n",
       "  -0.02064766217937648,\n",
       "  -0.013970762774683503,\n",
       "  0.01554744349672341,\n",
       "  0.01737090794223715,\n",
       "  -0.022279184763657898,\n",
       "  0.005487534328874801,\n",
       "  -0.019687943559988933,\n",
       "  -0.006752306732444406,\n",
       "  0.03112230699324498,\n",
       "  0.012400936586931838,\n",
       "  0.00923386514295294,\n",
       "  -0.03663383498609642,\n",
       "  0.005593788923568515,\n",
       "  -0.012448922983562512,\n",
       "  -0.019495999836111423,\n",
       "  0.0022107805573967714,\n",
       "  -0.018563701216522042,\n",
       "  0.006053083233413665,\n",
       "  0.01081054586499285,\n",
       "  0.014724826738971863,\n",
       "  -0.0391565233963022,\n",
       "  0.005857711776730738,\n",
       "  0.006796864930608364,\n",
       "  0.01652087304733263,\n",
       "  -0.003439563396324019,\n",
       "  0.006203896026271338,\n",
       "  -0.025583359000595385,\n",
       "  -0.040198505740374604,\n",
       "  -0.007643473955352654,\n",
       "  -0.002654650535278835,\n",
       "  -0.046066497455892516,\n",
       "  -0.03682577684732874,\n",
       "  -0.009556056194178203,\n",
       "  0.01179768541550115,\n",
       "  0.01066658760642342,\n",
       "  -0.03616768567630173,\n",
       "  0.010851676796012686,\n",
       "  0.007314427438516555,\n",
       "  0.01435465022243852,\n",
       "  -0.01066658760642342,\n",
       "  -0.018933879595700573,\n",
       "  0.015972461875498264,\n",
       "  -0.016123274668355937,\n",
       "  0.008795136764279005,\n",
       "  0.009878247245403466,\n",
       "  -0.028407674859161697,\n",
       "  0.0194411598365151,\n",
       "  -0.0005548373559372553,\n",
       "  0.002719774198952712,\n",
       "  0.02323890338304544,\n",
       "  -0.030546475821612455,\n",
       "  0.005449831130660383,\n",
       "  0.008397538385302312,\n",
       "  0.028928664168552713,\n",
       "  -0.02566562086263506,\n",
       "  -0.018385468423866208,\n",
       "  -0.018810486802641063,\n",
       "  -0.01148234889856413,\n",
       "  -0.021470278937128027,\n",
       "  0.019482290767534938,\n",
       "  0.018673384941005063,\n",
       "  -0.019756494490806933,\n",
       "  -0.020304905662641298,\n",
       "  -0.00566234032004781,\n",
       "  -0.002975127952932037,\n",
       "  0.02230660476345606,\n",
       "  -0.01218842739754441,\n",
       "  -0.0154240507036639,\n",
       "  -0.021127522420392845,\n",
       "  -0.0024918411432634942,\n",
       "  -0.0130521741549932,\n",
       "  -0.007821707213669786,\n",
       "  -0.006221033758975837,\n",
       "  0.022046110108760553,\n",
       "  0.02343084710692295,\n",
       "  -0.007314427438516555,\n",
       "  -0.03208202561263253,\n",
       "  -0.017576562597336337,\n",
       "  -0.018741935871823063,\n",
       "  0.013806239050604156,\n",
       "  -0.00959718712519804,\n",
       "  0.016726525839786625,\n",
       "  0.015780518151620754,\n",
       "  0.02673502134386044,\n",
       "  0.008987080488156513,\n",
       "  0.02698180692997946,\n",
       "  0.0006739453083670058,\n",
       "  0.021031549627131496,\n",
       "  -0.03671609684813609,\n",
       "  -0.012784824034686856,\n",
       "  0.021538829867946023,\n",
       "  -0.039129101533858845,\n",
       "  0.019153243319376245,\n",
       "  0.01686362956406781,\n",
       "  -0.04571003187058085,\n",
       "  0.01564341442733957,\n",
       "  0.028544776720797693,\n",
       "  0.013155001482542793,\n",
       "  -0.013600585326827565,\n",
       "  0.02129204614447219,\n",
       "  -0.02838025299671835,\n",
       "  0.00878142583305733,\n",
       "  0.006107924164332583,\n",
       "  -0.004843151760762979,\n",
       "  -0.01647974211631279,\n",
       "  0.0027060639662229826,\n",
       "  0.0035989452883645892,\n",
       "  -0.022210633832839898,\n",
       "  0.0030710998148707914,\n",
       "  -0.0005852570293937934,\n",
       "  -0.006416405215658765,\n",
       "  -0.003348732900762744,\n",
       "  -0.024856715036105186,\n",
       "  0.04044528760120325,\n",
       "  -0.011660582622542558,\n",
       "  -0.0062347442245362155,\n",
       "  -0.005775450380352361,\n",
       "  0.006361564284739847,\n",
       "  -0.021977559177942554,\n",
       "  -0.010029060969583732,\n",
       "  0.016095854668557775,\n",
       "  0.03402888471385097,\n",
       "  0.0033076019697429074,\n",
       "  0.008363262919893312,\n",
       "  -0.010529485744787423,\n",
       "  -0.006131916896986623,\n",
       "  -0.006015380035199247,\n",
       "  0.008020506403158132,\n",
       "  0.020126672869985464,\n",
       "  -0.01637005839182977,\n",
       "  0.011578320760502884,\n",
       "  -0.02925770975406622,\n",
       "  0.02130575521304868,\n",
       "  -0.011996483673666902,\n",
       "  -0.008274146523565395,\n",
       "  0.016054723737537937,\n",
       "  -0.017480591666720176,\n",
       "  -0.009700014452747633,\n",
       "  -0.010556905744585584,\n",
       "  -0.01741203887325699,\n",
       "  0.017672535390597682,\n",
       "  0.012236413794175085,\n",
       "  -0.01870080494080323,\n",
       "  0.006327288353669551,\n",
       "  -0.030683577683248454,\n",
       "  0.0030728136812735005,\n",
       "  -0.00030162587675365495,\n",
       "  -0.016795076770604624,\n",
       "  0.008418103850812231,\n",
       "  -0.00701965685275075,\n",
       "  -0.026433395758145094,\n",
       "  -0.016534582115909118,\n",
       "  -0.0025209754751256623,\n",
       "  0.03630478753793773,\n",
       "  0.020962998696313496,\n",
       "  -0.01111902691631903,\n",
       "  0.00828100105785364,\n",
       "  -0.0029339972547428486,\n",
       "  0.1889823266464037,\n",
       "  0.0052476046740279145,\n",
       "  -0.014382070222236682,\n",
       "  0.017233806080601155,\n",
       "  0.0072184555765778,\n",
       "  0.02336229617610495,\n",
       "  0.011468638898665048,\n",
       "  0.006580928474076815,\n",
       "  -0.005744602182087484,\n",
       "  0.008562062109381659,\n",
       "  0.019907309146309792,\n",
       "  -0.016644263977746952,\n",
       "  0.018933879595700573,\n",
       "  0.001691504299501196,\n",
       "  0.008637468505810495,\n",
       "  0.019962149145906116,\n",
       "  -0.01262715670754094,\n",
       "  -0.014848219532031373,\n",
       "  -0.006135344629792042,\n",
       "  -0.029038346030390547,\n",
       "  0.009007645953666432,\n",
       "  0.0021987841910697512,\n",
       "  0.01369655718876632,\n",
       "  -0.010440368417136912,\n",
       "  0.023718761761416622,\n",
       "  0.01402560370560242,\n",
       "  0.00021775759965549858,\n",
       "  -0.018673384941005063,\n",
       "  0.013888500912643828,\n",
       "  0.015108715118049475,\n",
       "  -0.016452320253869442,\n",
       "  0.020016991008147626,\n",
       "  -0.0009357257703181802,\n",
       "  0.015574863496521573,\n",
       "  -0.00893909409152584,\n",
       "  0.0031345098449726072,\n",
       "  -0.012339241121724676,\n",
       "  -0.014848219532031373,\n",
       "  -0.005412127932445965,\n",
       "  0.019125823319578083,\n",
       "  -0.00816446466172756,\n",
       "  -0.016452320253869442,\n",
       "  -0.03523538705671234,\n",
       "  -0.009624608056318795,\n",
       "  -0.012442067517951674,\n",
       "  0.04069207318732227,\n",
       "  ...],\n",
       " 'Metadata': ['stored_by_admin'],\n",
       " 'SummaryText': 'Study Name: Safety, Adherence and Persistence in a Real-World Cohort of German MS Patients Newly Treated With Ocrelizumab (CONFIDENCE) Identifier: STUDYMATCH-9c5807da-eb1b-49f9-84c6-f7715083685a Indication: Multiple Sclerosis Sub-Indication: UNKNOWN_VALUE Contact Names:  Marcia Gasis, Marc Pawlitzki Contact Emails: UNKNOWN_VALUE, marcguenter.pawlitzki@med.uni-duesseldorf.de Study Center Names: University Clinic Düsseldorf Criteria Values: N/A'}"
      ]
     },
     "execution_count": 107,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "data[1]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 108,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "data = loader.load()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 109,
   "metadata": {},
   "outputs": [
    {
     "ename": "TypeError",
     "evalue": "'Document' object is not subscriptable",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mTypeError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[1;32m/Users/linea/Repositories/genai-stack/test_workbook.ipynb Cell 28\u001b[0m line \u001b[0;36m5\n\u001b[1;32m      <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X40sZmlsZQ%3D%3D?line=0'>1</a>\u001b[0m \u001b[39m#text_splitter = RecursiveCharacterTextSplitter(chunk_size=500, chunk_overlap=0)\u001b[39;00m\n\u001b[1;32m      <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X40sZmlsZQ%3D%3D?line=1'>2</a>\u001b[0m \u001b[39m#all_splits = text_splitter.split_documents(data)\u001b[39;00m\n\u001b[1;32m      <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X40sZmlsZQ%3D%3D?line=2'>3</a>\u001b[0m \n\u001b[1;32m      <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X40sZmlsZQ%3D%3D?line=3'>4</a>\u001b[0m \u001b[39m# get from all studies in data the list of embeddings\u001b[39;00m\n\u001b[0;32m----> <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X40sZmlsZQ%3D%3D?line=4'>5</a>\u001b[0m embeddings \u001b[39m=\u001b[39m [study[\u001b[39m\"\u001b[39m\u001b[39mEmbedding\u001b[39m\u001b[39m\"\u001b[39m] \u001b[39mfor\u001b[39;00m study \u001b[39min\u001b[39;00m data]\n\u001b[1;32m      <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X40sZmlsZQ%3D%3D?line=5'>6</a>\u001b[0m vectorstore \u001b[39m=\u001b[39m Chroma\u001b[39m.\u001b[39mfrom_embeddings(embeddings)\n\u001b[1;32m      <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X40sZmlsZQ%3D%3D?line=6'>7</a>\u001b[0m memory \u001b[39m=\u001b[39m ConversationSummaryMemory(llm\u001b[39m=\u001b[39mllm, memory_key\u001b[39m=\u001b[39m\u001b[39m\"\u001b[39m\u001b[39mchat_history\u001b[39m\u001b[39m\"\u001b[39m, return_messages\u001b[39m=\u001b[39m\u001b[39mTrue\u001b[39;00m)\n",
      "\u001b[1;32m/Users/linea/Repositories/genai-stack/test_workbook.ipynb Cell 28\u001b[0m line \u001b[0;36m5\n\u001b[1;32m      <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X40sZmlsZQ%3D%3D?line=0'>1</a>\u001b[0m \u001b[39m#text_splitter = RecursiveCharacterTextSplitter(chunk_size=500, chunk_overlap=0)\u001b[39;00m\n\u001b[1;32m      <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X40sZmlsZQ%3D%3D?line=1'>2</a>\u001b[0m \u001b[39m#all_splits = text_splitter.split_documents(data)\u001b[39;00m\n\u001b[1;32m      <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X40sZmlsZQ%3D%3D?line=2'>3</a>\u001b[0m \n\u001b[1;32m      <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X40sZmlsZQ%3D%3D?line=3'>4</a>\u001b[0m \u001b[39m# get from all studies in data the list of embeddings\u001b[39;00m\n\u001b[0;32m----> <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X40sZmlsZQ%3D%3D?line=4'>5</a>\u001b[0m embeddings \u001b[39m=\u001b[39m [study[\u001b[39m\"\u001b[39;49m\u001b[39mEmbedding\u001b[39;49m\u001b[39m\"\u001b[39;49m] \u001b[39mfor\u001b[39;00m study \u001b[39min\u001b[39;00m data]\n\u001b[1;32m      <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X40sZmlsZQ%3D%3D?line=5'>6</a>\u001b[0m vectorstore \u001b[39m=\u001b[39m Chroma\u001b[39m.\u001b[39mfrom_embeddings(embeddings)\n\u001b[1;32m      <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X40sZmlsZQ%3D%3D?line=6'>7</a>\u001b[0m memory \u001b[39m=\u001b[39m ConversationSummaryMemory(llm\u001b[39m=\u001b[39mllm, memory_key\u001b[39m=\u001b[39m\u001b[39m\"\u001b[39m\u001b[39mchat_history\u001b[39m\u001b[39m\"\u001b[39m, return_messages\u001b[39m=\u001b[39m\u001b[39mTrue\u001b[39;00m)\n",
      "\u001b[0;31mTypeError\u001b[0m: 'Document' object is not subscriptable"
     ]
    }
   ],
   "source": [
    "#text_splitter = RecursiveCharacterTextSplitter(chunk_size=500, chunk_overlap=0)\n",
    "#all_splits = text_splitter.split_documents(data)\n",
    "\n",
    "# get from all studies in data the list of embeddings\n",
    "embeddings = [study[\"Embedding\"] for study in data]\n",
    "vectorstore = Chroma.from_embeddings(embeddings)\n",
    "memory = ConversationSummaryMemory(llm=llm, memory_key=\"chat_history\", return_messages=True)\n",
    "\n",
    "retriever = vectorstore.as_retriever()\n",
    "qa = ConversationalRetrievalChain.from_llm(llm, retriever=retriever, memory=memory)\n",
    "\n",
    "response = qa(\"How do agents use Task decomposition?\")\n",
    "print(response)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Direct conn to NEO4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 110,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.graphs import Neo4jGraph\n",
    "from langchain.vectorstores.neo4j_vector import Neo4jVector\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 111,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Neo4jGraph(\n",
    "    url=\"bolt://localhost:7687\", username=\"neo4j\", password=\"password\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 112,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "        Node properties are the following:\n",
      "        [{'properties': [{'property': 'name', 'type': 'STRING'}, {'property': 'short_name', 'type': 'STRING'}, {'property': 'identifier', 'type': 'STRING'}, {'property': 'metadata', 'type': 'LIST'}, {'property': 'embedding', 'type': 'LIST'}], 'labels': 'Study'}, {'properties': [{'property': 'name', 'type': 'STRING'}], 'labels': 'StudyCenter'}, {'properties': [{'property': 'name', 'type': 'STRING'}], 'labels': 'Indication'}, {'properties': [{'property': 'name', 'type': 'STRING'}], 'labels': 'SubIndication'}, {'properties': [{'property': 'name', 'type': 'STRING'}], 'labels': 'Contact'}, {'properties': [{'property': 'description', 'type': 'STRING'}], 'labels': 'Criteria'}]\n",
      "        Relationship properties are the following:\n",
      "        [{'type': 'HAS_CONTACT', 'properties': [{'property': 'email', 'type': 'STRING'}]}]\n",
      "        The relationships are the following:\n",
      "        ['(:Study)-[:HAS_CRITERIA]->(:Criteria)', '(:Study)-[:CONDUCTED_AT]->(:StudyCenter)', '(:Study)-[:HAS_INDICATION]->(:Indication)', '(:Study)-[:HAS_SUBINDICATION]->(:SubIndication)', '(:Study)-[:HAS_CONTACT]->(:Contact)']\n",
      "        \n"
     ]
    }
   ],
   "source": [
    "print(graph.schema) #works - Langchain gets good connection as it seems"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 113,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (s:Study)-[:CONDUCTED_AT]->(sc:StudyCenter)\n",
      "RETURN sc.name AS study_location, count(*) AS count\n",
      "ORDER BY count DESC\n",
      "LIMIT 1\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'study_location': 'University Clinic Düsseldorf', 'count': 13}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The most common study location is the University Clinic Düsseldorf, with a count of 13.'"
      ]
     },
     "execution_count": 113,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from langchain.chains import GraphCypherQAChain\n",
    "neo4j_graph = Neo4jGraph(url=\"bolt://localhost:7687\", username=\"neo4j\", password=\"password\")\n",
    "chain = GraphCypherQAChain.from_llm(\n",
    "    ChatOpenAI(temperature=0), graph=graph, verbose=True\n",
    ")\n",
    "chain.run(\"What is the most common study location?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 115,
   "metadata": {},
   "outputs": [
    {
     "ename": "ValueError",
     "evalue": "Cannot resolve address database:7687",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mgaierror\u001b[0m                                  Traceback (most recent call last)",
      "File \u001b[0;32m~/.local/share/virtualenvs/genai-stack-u9ltUab-/lib/python3.9/site-packages/neo4j/_async_compat/network/_util.py:114\u001b[0m, in \u001b[0;36mNetworkUtil._dns_resolver\u001b[0;34m(address, family)\u001b[0m\n\u001b[1;32m    113\u001b[0m \u001b[39mtry\u001b[39;00m:\n\u001b[0;32m--> 114\u001b[0m     info \u001b[39m=\u001b[39m NetworkUtil\u001b[39m.\u001b[39;49mget_address_info(\n\u001b[1;32m    115\u001b[0m         address\u001b[39m.\u001b[39;49mhost, address\u001b[39m.\u001b[39;49mport, family\u001b[39m=\u001b[39;49mfamily,\n\u001b[1;32m    116\u001b[0m         \u001b[39mtype\u001b[39;49m\u001b[39m=\u001b[39;49msocket\u001b[39m.\u001b[39;49mSOCK_STREAM\n\u001b[1;32m    117\u001b[0m     )\n\u001b[1;32m    118\u001b[0m \u001b[39mexcept\u001b[39;00m \u001b[39mOSError\u001b[39;00m:\n",
      "File \u001b[0;32m~/.local/share/virtualenvs/genai-stack-u9ltUab-/lib/python3.9/site-packages/neo4j/_async_compat/network/_util.py:102\u001b[0m, in \u001b[0;36mNetworkUtil.get_address_info\u001b[0;34m(host, port, family, type, proto, flags)\u001b[0m\n\u001b[1;32m    100\u001b[0m \u001b[39m@staticmethod\u001b[39m\n\u001b[1;32m    101\u001b[0m \u001b[39mdef\u001b[39;00m \u001b[39mget_address_info\u001b[39m(host, port, \u001b[39m*\u001b[39m, family\u001b[39m=\u001b[39m\u001b[39m0\u001b[39m, \u001b[39mtype\u001b[39m\u001b[39m=\u001b[39m\u001b[39m0\u001b[39m, proto\u001b[39m=\u001b[39m\u001b[39m0\u001b[39m, flags\u001b[39m=\u001b[39m\u001b[39m0\u001b[39m):\n\u001b[0;32m--> 102\u001b[0m     \u001b[39mreturn\u001b[39;00m socket\u001b[39m.\u001b[39;49mgetaddrinfo(host, port, family, \u001b[39mtype\u001b[39;49m, proto, flags)\n",
      "File \u001b[0;32m/opt/homebrew/Cellar/python@3.9/3.9.13_1/Frameworks/Python.framework/Versions/3.9/lib/python3.9/socket.py:954\u001b[0m, in \u001b[0;36mgetaddrinfo\u001b[0;34m(host, port, family, type, proto, flags)\u001b[0m\n\u001b[1;32m    953\u001b[0m addrlist \u001b[39m=\u001b[39m []\n\u001b[0;32m--> 954\u001b[0m \u001b[39mfor\u001b[39;00m res \u001b[39min\u001b[39;00m _socket\u001b[39m.\u001b[39;49mgetaddrinfo(host, port, family, \u001b[39mtype\u001b[39;49m, proto, flags):\n\u001b[1;32m    955\u001b[0m     af, socktype, proto, canonname, sa \u001b[39m=\u001b[39m res\n",
      "\u001b[0;31mgaierror\u001b[0m: [Errno 8] nodename nor servname provided, or not known",
      "\nDuring handling of the above exception, another exception occurred:\n",
      "\u001b[0;31mValueError\u001b[0m                                Traceback (most recent call last)",
      "\u001b[1;32m/Users/linea/Repositories/genai-stack/test_workbook.ipynb Cell 34\u001b[0m line \u001b[0;36m2\n\u001b[1;32m      <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=0'>1</a>\u001b[0m \u001b[39m# Vector + Knowledge Graph response\u001b[39;00m\n\u001b[0;32m----> <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=1'>2</a>\u001b[0m kg \u001b[39m=\u001b[39m Neo4jVector\u001b[39m.\u001b[39;49mfrom_existing_index(\n\u001b[1;32m      <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=2'>3</a>\u001b[0m     embedding\u001b[39m=\u001b[39;49m\u001b[39m\"\u001b[39;49m\u001b[39membedding\u001b[39;49m\u001b[39m\"\u001b[39;49m,\n\u001b[1;32m      <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=3'>4</a>\u001b[0m     url\u001b[39m=\u001b[39;49m\u001b[39m\"\u001b[39;49m\u001b[39mbolt://localhost:7687\u001b[39;49m\u001b[39m\"\u001b[39;49m,\n\u001b[1;32m      <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=4'>5</a>\u001b[0m     username\u001b[39m=\u001b[39;49m\u001b[39m\"\u001b[39;49m\u001b[39mneo4j\u001b[39;49m\u001b[39m\"\u001b[39;49m,\n\u001b[1;32m      <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=5'>6</a>\u001b[0m     password\u001b[39m=\u001b[39;49m\u001b[39m\"\u001b[39;49m\u001b[39mpassword\u001b[39;49m\u001b[39m\"\u001b[39;49m,\n\u001b[1;32m      <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=6'>7</a>\u001b[0m     database\u001b[39m=\u001b[39;49m\u001b[39m\"\u001b[39;49m\u001b[39mneo4j\u001b[39;49m\u001b[39m\"\u001b[39;49m,  \u001b[39m# neo4j by default\u001b[39;49;00m\n\u001b[1;32m      <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=7'>8</a>\u001b[0m     index_name\u001b[39m=\u001b[39;49m\u001b[39m\"\u001b[39;49m\u001b[39mstudy_data\u001b[39;49m\u001b[39m\"\u001b[39;49m,  \u001b[39m# vector by default\u001b[39;49;00m\n\u001b[1;32m      <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=8'>9</a>\u001b[0m     text_node_property\u001b[39m=\u001b[39;49m\u001b[39m\"\u001b[39;49m\u001b[39mbody\u001b[39;49m\u001b[39m\"\u001b[39;49m,  \u001b[39m# text by default\u001b[39;49;00m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=9'>10</a>\u001b[0m     retrieval_query\u001b[39m=\u001b[39;49m\u001b[39m\"\"\"\u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=10'>11</a>\u001b[0m \u001b[39m    MATCH (s:Study)\u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=11'>12</a>\u001b[0m \u001b[39mWITH s, s.score AS similarity\u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=12'>13</a>\u001b[0m \u001b[39mCALL \u001b[39;49m\u001b[39m{\u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=13'>14</a>\u001b[0m \u001b[39m    WITH s\u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=14'>15</a>\u001b[0m \u001b[39m    OPTIONAL MATCH (study)-[:HAS_INDICATION]->(ind:Indication)\u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=15'>16</a>\u001b[0m \u001b[39m    OPTIONAL MATCH (study)-[:HAS_SUBINDICATION]->(sub:SubIndication)\u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=16'>17</a>\u001b[0m \u001b[39m    OPTIONAL MATCH (study)-[relContact:HAS_CONTACT]->(con:Contact)\u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=17'>18</a>\u001b[0m \u001b[39m    OPTIONAL MATCH (study)-[:CONDUCTED_AT]->(sc:StudyCenter)\u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=18'>19</a>\u001b[0m \u001b[39m    OPTIONAL MATCH (study)-[:HAS_CRITERIA]->(criteria)\u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=19'>20</a>\u001b[0m \u001b[39m    WITH study, ind, sub, \u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=20'>21</a>\u001b[0m \u001b[39m        COLLECT(DISTINCT con.name) AS ContactNames, \u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=21'>22</a>\u001b[0m \u001b[39m        COLLECT(DISTINCT relContact.email) AS ContactEmails,\u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=22'>23</a>\u001b[0m \u001b[39m        COLLECT(DISTINCT sc.name) AS StudyCenterNames, \u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=23'>24</a>\u001b[0m \u001b[39m        COLLECT(DISTINCT criteria.value) AS CriteriaValues\u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=24'>25</a>\u001b[0m \u001b[39m    RETURN \u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=25'>26</a>\u001b[0m \u001b[39m    \u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m##Study Name: \u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m + study.name + \u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=26'>27</a>\u001b[0m \u001b[39m    \u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m\\n\u001b[39;49;00m\u001b[39mIdentifier: \u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m + study.identifier + \u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=27'>28</a>\u001b[0m \u001b[39m    COALESCE(\u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m\\n\u001b[39;49;00m\u001b[39mIndication: \u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m + ind.name, \u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m) + \u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=28'>29</a>\u001b[0m \u001b[39m    COALESCE(\u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m\\n\u001b[39;49;00m\u001b[39mSub-Indication: \u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m + sub.name, \u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m) + \u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=29'>30</a>\u001b[0m \u001b[39m    \u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m\\n\u001b[39;49;00m\u001b[39mContact Names: \u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m + reduce(str=\u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m, name IN ContactNames | str + name + \u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m; \u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m) + \u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=30'>31</a>\u001b[0m \u001b[39m    \u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m\\n\u001b[39;49;00m\u001b[39mContact Emails: \u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m + reduce(str=\u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m, email IN ContactEmails | str + email + \u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m; \u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m) + \u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=31'>32</a>\u001b[0m \u001b[39m    \u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m\\n\u001b[39;49;00m\u001b[39mStudy Center Names: \u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m + reduce(str=\u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m, name IN StudyCenterNames | str + name + \u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m; \u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m) + \u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=32'>33</a>\u001b[0m \u001b[39m    \u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m\\n\u001b[39;49;00m\u001b[39mCriteria Values: \u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m + reduce(str=\u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m, value IN CriteriaValues | str + value + \u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m; \u001b[39;49m\u001b[39m'\u001b[39;49m\u001b[39m) AS text, ind, sub\u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=33'>34</a>\u001b[0m \u001b[39m} \u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=34'>35</a>\u001b[0m \u001b[39mWITH text, s, similarity, ind, sub\u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=35'>36</a>\u001b[0m \u001b[39mRETURN text,\u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=36'>37</a>\u001b[0m \u001b[39m       similarity,\u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=37'>38</a>\u001b[0m \u001b[39m       s.identifier AS StudyIdentifier,\u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=38'>39</a>\u001b[0m \u001b[39m       COALESCE(ind.name, \u001b[39;49m\u001b[39m\"\u001b[39;49m\u001b[39mN/A\u001b[39;49m\u001b[39m\"\u001b[39;49m\u001b[39m) AS Indication,\u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=39'>40</a>\u001b[0m \u001b[39m       COALESCE(sub.name, \u001b[39;49m\u001b[39m\"\u001b[39;49m\u001b[39mN/A\u001b[39;49m\u001b[39m\"\u001b[39;49m\u001b[39m) AS SubIndication,\u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=40'>41</a>\u001b[0m \u001b[39m       s.embedding AS embedding,\u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=41'>42</a>\u001b[0m \u001b[39m       s.metadata AS metadata\u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=42'>43</a>\u001b[0m \u001b[39mORDER BY similarity ASC\u001b[39;49m\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=43'>44</a>\u001b[0m \n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=44'>45</a>\u001b[0m \u001b[39m\"\"\"\u001b[39;49m,\n\u001b[1;32m     <a href='vscode-notebook-cell:/Users/linea/Repositories/genai-stack/test_workbook.ipynb#X45sZmlsZQ%3D%3D?line=45'>46</a>\u001b[0m )\n",
      "File \u001b[0;32m~/.local/share/virtualenvs/genai-stack-u9ltUab-/lib/python3.9/site-packages/langchain/vectorstores/neo4j_vector.py:724\u001b[0m, in \u001b[0;36mNeo4jVector.from_existing_index\u001b[0;34m(cls, embedding, index_name, search_type, keyword_index_name, **kwargs)\u001b[0m\n\u001b[1;32m    718\u001b[0m \u001b[39mif\u001b[39;00m search_type \u001b[39m==\u001b[39m SearchType\u001b[39m.\u001b[39mHYBRID \u001b[39mand\u001b[39;00m \u001b[39mnot\u001b[39;00m keyword_index_name:\n\u001b[1;32m    719\u001b[0m     \u001b[39mraise\u001b[39;00m \u001b[39mValueError\u001b[39;00m(\n\u001b[1;32m    720\u001b[0m         \u001b[39m\"\u001b[39m\u001b[39mkeyword_index name has to be specified \u001b[39m\u001b[39m\"\u001b[39m\n\u001b[1;32m    721\u001b[0m         \u001b[39m\"\u001b[39m\u001b[39mwhen using hybrid search option\u001b[39m\u001b[39m\"\u001b[39m\n\u001b[1;32m    722\u001b[0m     )\n\u001b[0;32m--> 724\u001b[0m store \u001b[39m=\u001b[39m \u001b[39mcls\u001b[39;49m(\n\u001b[1;32m    725\u001b[0m     embedding\u001b[39m=\u001b[39;49membedding,\n\u001b[1;32m    726\u001b[0m     index_name\u001b[39m=\u001b[39;49mindex_name,\n\u001b[1;32m    727\u001b[0m     keyword_index_name\u001b[39m=\u001b[39;49mkeyword_index_name,\n\u001b[1;32m    728\u001b[0m     search_type\u001b[39m=\u001b[39;49msearch_type,\n\u001b[1;32m    729\u001b[0m     \u001b[39m*\u001b[39;49m\u001b[39m*\u001b[39;49mkwargs,\n\u001b[1;32m    730\u001b[0m )\n\u001b[1;32m    732\u001b[0m embedding_dimension \u001b[39m=\u001b[39m store\u001b[39m.\u001b[39mretrieve_existing_index()\n\u001b[1;32m    734\u001b[0m \u001b[39mif\u001b[39;00m \u001b[39mnot\u001b[39;00m embedding_dimension:\n",
      "File \u001b[0;32m~/.local/share/virtualenvs/genai-stack-u9ltUab-/lib/python3.9/site-packages/langchain/vectorstores/neo4j_vector.py:166\u001b[0m, in \u001b[0;36mNeo4jVector.__init__\u001b[0;34m(self, embedding, search_type, username, password, url, keyword_index_name, database, index_name, node_label, embedding_node_property, text_node_property, distance_strategy, logger, pre_delete_collection, retrieval_query, relevance_score_fn)\u001b[0m\n\u001b[1;32m    164\u001b[0m \u001b[39m# Verify connection\u001b[39;00m\n\u001b[1;32m    165\u001b[0m \u001b[39mtry\u001b[39;00m:\n\u001b[0;32m--> 166\u001b[0m     \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_driver\u001b[39m.\u001b[39;49mverify_connectivity()\n\u001b[1;32m    167\u001b[0m \u001b[39mexcept\u001b[39;00m neo4j\u001b[39m.\u001b[39mexceptions\u001b[39m.\u001b[39mServiceUnavailable:\n\u001b[1;32m    168\u001b[0m     \u001b[39mraise\u001b[39;00m \u001b[39mValueError\u001b[39;00m(\n\u001b[1;32m    169\u001b[0m         \u001b[39m\"\u001b[39m\u001b[39mCould not connect to Neo4j database. \u001b[39m\u001b[39m\"\u001b[39m\n\u001b[1;32m    170\u001b[0m         \u001b[39m\"\u001b[39m\u001b[39mPlease ensure that the url is correct\u001b[39m\u001b[39m\"\u001b[39m\n\u001b[1;32m    171\u001b[0m     )\n",
      "File \u001b[0;32m~/.local/share/virtualenvs/genai-stack-u9ltUab-/lib/python3.9/site-packages/neo4j/_sync/driver.py:985\u001b[0m, in \u001b[0;36mDriver.verify_connectivity\u001b[0;34m(self, **config)\u001b[0m\n\u001b[1;32m    978\u001b[0m     experimental_warn(\n\u001b[1;32m    979\u001b[0m         \u001b[39m\"\u001b[39m\u001b[39mAll configuration key-word arguments to \u001b[39m\u001b[39m\"\u001b[39m\n\u001b[1;32m    980\u001b[0m         \u001b[39m\"\u001b[39m\u001b[39mverify_connectivity() are experimental. They might be \u001b[39m\u001b[39m\"\u001b[39m\n\u001b[1;32m    981\u001b[0m         \u001b[39m\"\u001b[39m\u001b[39mchanged or removed in any future version without prior \u001b[39m\u001b[39m\"\u001b[39m\n\u001b[1;32m    982\u001b[0m         \u001b[39m\"\u001b[39m\u001b[39mnotice.\u001b[39m\u001b[39m\"\u001b[39m\n\u001b[1;32m    983\u001b[0m     )\n\u001b[1;32m    984\u001b[0m session_config \u001b[39m=\u001b[39m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_read_session_config(config)\n\u001b[0;32m--> 985\u001b[0m \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_get_server_info(session_config)\n",
      "File \u001b[0;32m~/.local/share/virtualenvs/genai-stack-u9ltUab-/lib/python3.9/site-packages/neo4j/_sync/driver.py:1200\u001b[0m, in \u001b[0;36mDriver._get_server_info\u001b[0;34m(self, session_config)\u001b[0m\n\u001b[1;32m   1198\u001b[0m \u001b[39mdef\u001b[39;00m \u001b[39m_get_server_info\u001b[39m(\u001b[39mself\u001b[39m, session_config) \u001b[39m-\u001b[39m\u001b[39m>\u001b[39m ServerInfo:\n\u001b[1;32m   1199\u001b[0m     \u001b[39mwith\u001b[39;00m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_session(session_config) \u001b[39mas\u001b[39;00m session:\n\u001b[0;32m-> 1200\u001b[0m         \u001b[39mreturn\u001b[39;00m session\u001b[39m.\u001b[39;49m_get_server_info()\n",
      "File \u001b[0;32m~/.local/share/virtualenvs/genai-stack-u9ltUab-/lib/python3.9/site-packages/neo4j/_sync/work/session.py:175\u001b[0m, in \u001b[0;36mSession._get_server_info\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    173\u001b[0m \u001b[39mdef\u001b[39;00m \u001b[39m_get_server_info\u001b[39m(\u001b[39mself\u001b[39m):\n\u001b[1;32m    174\u001b[0m     \u001b[39massert\u001b[39;00m \u001b[39mnot\u001b[39;00m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_connection\n\u001b[0;32m--> 175\u001b[0m     \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_connect(READ_ACCESS, liveness_check_timeout\u001b[39m=\u001b[39;49m\u001b[39m0\u001b[39;49m)\n\u001b[1;32m    176\u001b[0m     server_info \u001b[39m=\u001b[39m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_connection\u001b[39m.\u001b[39mserver_info\n\u001b[1;32m    177\u001b[0m     \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_disconnect()\n",
      "File \u001b[0;32m~/.local/share/virtualenvs/genai-stack-u9ltUab-/lib/python3.9/site-packages/neo4j/_sync/work/session.py:133\u001b[0m, in \u001b[0;36mSession._connect\u001b[0;34m(self, access_mode, **acquire_kwargs)\u001b[0m\n\u001b[1;32m    131\u001b[0m     access_mode \u001b[39m=\u001b[39m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_config\u001b[39m.\u001b[39mdefault_access_mode\n\u001b[1;32m    132\u001b[0m \u001b[39mtry\u001b[39;00m:\n\u001b[0;32m--> 133\u001b[0m     \u001b[39msuper\u001b[39;49m()\u001b[39m.\u001b[39;49m_connect(\n\u001b[1;32m    134\u001b[0m         access_mode, auth\u001b[39m=\u001b[39;49m\u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_config\u001b[39m.\u001b[39;49mauth, \u001b[39m*\u001b[39;49m\u001b[39m*\u001b[39;49macquire_kwargs\n\u001b[1;32m    135\u001b[0m     )\n\u001b[1;32m    136\u001b[0m \u001b[39mexcept\u001b[39;00m asyncio\u001b[39m.\u001b[39mCancelledError:\n\u001b[1;32m    137\u001b[0m     \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_handle_cancellation(message\u001b[39m=\u001b[39m\u001b[39m\"\u001b[39m\u001b[39m_connect\u001b[39m\u001b[39m\"\u001b[39m)\n",
      "File \u001b[0;32m~/.local/share/virtualenvs/genai-stack-u9ltUab-/lib/python3.9/site-packages/neo4j/_sync/work/workspace.py:161\u001b[0m, in \u001b[0;36mWorkspace._connect\u001b[0;34m(self, access_mode, auth, **acquire_kwargs)\u001b[0m\n\u001b[1;32m    153\u001b[0m     \u001b[39melse\u001b[39;00m:\n\u001b[1;32m    154\u001b[0m         \u001b[39m# This is the first time we open a connection to a server in a\u001b[39;00m\n\u001b[1;32m    155\u001b[0m         \u001b[39m# cluster environment for this session without explicitly\u001b[39;00m\n\u001b[0;32m   (...)\u001b[0m\n\u001b[1;32m    158\u001b[0m         \u001b[39m# we shall use this database explicitly for all subsequent\u001b[39;00m\n\u001b[1;32m    159\u001b[0m         \u001b[39m# actions within this session.\u001b[39;00m\n\u001b[1;32m    160\u001b[0m         log\u001b[39m.\u001b[39mdebug(\u001b[39m\"\u001b[39m\u001b[39m[#0000]  _: <WORKSPACE> resolve home database\u001b[39m\u001b[39m\"\u001b[39m)\n\u001b[0;32m--> 161\u001b[0m         \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_pool\u001b[39m.\u001b[39;49mupdate_routing_table(\n\u001b[1;32m    162\u001b[0m             database\u001b[39m=\u001b[39;49m\u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_config\u001b[39m.\u001b[39;49mdatabase,\n\u001b[1;32m    163\u001b[0m             imp_user\u001b[39m=\u001b[39;49m\u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_config\u001b[39m.\u001b[39;49mimpersonated_user,\n\u001b[1;32m    164\u001b[0m             bookmarks\u001b[39m=\u001b[39;49m\u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_get_bookmarks(),\n\u001b[1;32m    165\u001b[0m             auth\u001b[39m=\u001b[39;49mauth,\n\u001b[1;32m    166\u001b[0m             acquisition_timeout\u001b[39m=\u001b[39;49macquisition_timeout,\n\u001b[1;32m    167\u001b[0m             database_callback\u001b[39m=\u001b[39;49m\u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_set_cached_database\n\u001b[1;32m    168\u001b[0m         )\n\u001b[1;32m    169\u001b[0m acquire_kwargs_ \u001b[39m=\u001b[39m {\n\u001b[1;32m    170\u001b[0m     \u001b[39m\"\u001b[39m\u001b[39maccess_mode\u001b[39m\u001b[39m\"\u001b[39m: access_mode,\n\u001b[1;32m    171\u001b[0m     \u001b[39m\"\u001b[39m\u001b[39mtimeout\u001b[39m\u001b[39m\"\u001b[39m: acquisition_timeout,\n\u001b[0;32m   (...)\u001b[0m\n\u001b[1;32m    175\u001b[0m     \u001b[39m\"\u001b[39m\u001b[39mliveness_check_timeout\u001b[39m\u001b[39m\"\u001b[39m: \u001b[39mNone\u001b[39;00m,\n\u001b[1;32m    176\u001b[0m }\n\u001b[1;32m    177\u001b[0m acquire_kwargs_\u001b[39m.\u001b[39mupdate(acquire_kwargs)\n",
      "File \u001b[0;32m~/.local/share/virtualenvs/genai-stack-u9ltUab-/lib/python3.9/site-packages/neo4j/_sync/io/_pool.py:776\u001b[0m, in \u001b[0;36mNeo4jPool.update_routing_table\u001b[0;34m(self, database, imp_user, bookmarks, auth, acquisition_timeout, database_callback)\u001b[0m\n\u001b[1;32m    771\u001b[0m prefer_initial_routing_address \u001b[39m=\u001b[39m \\\n\u001b[1;32m    772\u001b[0m     \u001b[39mself\u001b[39m\u001b[39m.\u001b[39mrouting_tables[database]\u001b[39m.\u001b[39minitialized_without_writers\n\u001b[1;32m    774\u001b[0m \u001b[39mif\u001b[39;00m prefer_initial_routing_address:\n\u001b[1;32m    775\u001b[0m     \u001b[39m# TODO: Test this state\u001b[39;00m\n\u001b[0;32m--> 776\u001b[0m     \u001b[39mif\u001b[39;00m \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_update_routing_table_from(\n\u001b[1;32m    777\u001b[0m         \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49maddress, database\u001b[39m=\u001b[39;49mdatabase,\n\u001b[1;32m    778\u001b[0m         imp_user\u001b[39m=\u001b[39;49mimp_user, bookmarks\u001b[39m=\u001b[39;49mbookmarks, auth\u001b[39m=\u001b[39;49mauth,\n\u001b[1;32m    779\u001b[0m         acquisition_timeout\u001b[39m=\u001b[39;49macquisition_timeout,\n\u001b[1;32m    780\u001b[0m         database_callback\u001b[39m=\u001b[39;49mdatabase_callback\n\u001b[1;32m    781\u001b[0m     ):\n\u001b[1;32m    782\u001b[0m         \u001b[39m# Why is only the first initial routing address used?\u001b[39;00m\n\u001b[1;32m    783\u001b[0m         \u001b[39mreturn\u001b[39;00m\n\u001b[1;32m    784\u001b[0m \u001b[39mif\u001b[39;00m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_update_routing_table_from(\n\u001b[1;32m    785\u001b[0m     \u001b[39m*\u001b[39m(existing_routers \u001b[39m-\u001b[39m {\u001b[39mself\u001b[39m\u001b[39m.\u001b[39maddress}), database\u001b[39m=\u001b[39mdatabase,\n\u001b[1;32m    786\u001b[0m     imp_user\u001b[39m=\u001b[39mimp_user, bookmarks\u001b[39m=\u001b[39mbookmarks, auth\u001b[39m=\u001b[39mauth,\n\u001b[1;32m    787\u001b[0m     acquisition_timeout\u001b[39m=\u001b[39macquisition_timeout,\n\u001b[1;32m    788\u001b[0m     database_callback\u001b[39m=\u001b[39mdatabase_callback\n\u001b[1;32m    789\u001b[0m ):\n",
      "File \u001b[0;32m~/.local/share/virtualenvs/genai-stack-u9ltUab-/lib/python3.9/site-packages/neo4j/_sync/io/_pool.py:719\u001b[0m, in \u001b[0;36mNeo4jPool._update_routing_table_from\u001b[0;34m(self, database, imp_user, bookmarks, auth, acquisition_timeout, database_callback, *routers)\u001b[0m\n\u001b[1;32m    716\u001b[0m     log\u001b[39m.\u001b[39mdebug(\u001b[39m\"\u001b[39m\u001b[39m[#0000]  _: <POOL> attempting to update routing \u001b[39m\u001b[39m\"\u001b[39m\n\u001b[1;32m    717\u001b[0m               \u001b[39m\"\u001b[39m\u001b[39mtable from \u001b[39m\u001b[39m{}\u001b[39;00m\u001b[39m\"\u001b[39m\u001b[39m.\u001b[39mformat(\u001b[39m\"\u001b[39m\u001b[39m, \u001b[39m\u001b[39m\"\u001b[39m\u001b[39m.\u001b[39mjoin(\u001b[39mmap\u001b[39m(\u001b[39mrepr\u001b[39m, routers))))\n\u001b[1;32m    718\u001b[0m \u001b[39mfor\u001b[39;00m router \u001b[39min\u001b[39;00m routers:\n\u001b[0;32m--> 719\u001b[0m     \u001b[39mfor\u001b[39;00m address \u001b[39min\u001b[39;00m NetworkUtil\u001b[39m.\u001b[39mresolve_address(\n\u001b[1;32m    720\u001b[0m         router, resolver\u001b[39m=\u001b[39m\u001b[39mself\u001b[39m\u001b[39m.\u001b[39mpool_config\u001b[39m.\u001b[39mresolver\n\u001b[1;32m    721\u001b[0m     ):\n\u001b[1;32m    722\u001b[0m         new_routing_table \u001b[39m=\u001b[39m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39mfetch_routing_table(\n\u001b[1;32m    723\u001b[0m             address\u001b[39m=\u001b[39maddress, acquisition_timeout\u001b[39m=\u001b[39macquisition_timeout,\n\u001b[1;32m    724\u001b[0m             database\u001b[39m=\u001b[39mdatabase, imp_user\u001b[39m=\u001b[39mimp_user, bookmarks\u001b[39m=\u001b[39mbookmarks,\n\u001b[1;32m    725\u001b[0m             auth\u001b[39m=\u001b[39mauth\n\u001b[1;32m    726\u001b[0m         )\n\u001b[1;32m    727\u001b[0m         \u001b[39mif\u001b[39;00m new_routing_table \u001b[39mis\u001b[39;00m \u001b[39mnot\u001b[39;00m \u001b[39mNone\u001b[39;00m:\n",
      "File \u001b[0;32m~/.local/share/virtualenvs/genai-stack-u9ltUab-/lib/python3.9/site-packages/neo4j/_async_compat/network/_util.py:157\u001b[0m, in \u001b[0;36mNetworkUtil.resolve_address\u001b[0;34m(address, family, resolver)\u001b[0m\n\u001b[1;32m    155\u001b[0m             \u001b[39myield\u001b[39;00m resolved_address\n\u001b[1;32m    156\u001b[0m \u001b[39melse\u001b[39;00m:\n\u001b[0;32m--> 157\u001b[0m     \u001b[39mfor\u001b[39;00m resolved_address \u001b[39min\u001b[39;00m NetworkUtil\u001b[39m.\u001b[39;49m_dns_resolver(\n\u001b[1;32m    158\u001b[0m         address, family\u001b[39m=\u001b[39;49mfamily\n\u001b[1;32m    159\u001b[0m     ):\n\u001b[1;32m    160\u001b[0m         log\u001b[39m.\u001b[39mdebug(\u001b[39m\"\u001b[39m\u001b[39m[#0000]  _: <RESOLVE> dns resolver out: \u001b[39m\u001b[39m%s\u001b[39;00m\u001b[39m\"\u001b[39m,\n\u001b[1;32m    161\u001b[0m                   resolved_address)\n\u001b[1;32m    162\u001b[0m         \u001b[39myield\u001b[39;00m resolved_address\n",
      "File \u001b[0;32m~/.local/share/virtualenvs/genai-stack-u9ltUab-/lib/python3.9/site-packages/neo4j/_async_compat/network/_util.py:119\u001b[0m, in \u001b[0;36mNetworkUtil._dns_resolver\u001b[0;34m(address, family)\u001b[0m\n\u001b[1;32m    114\u001b[0m     info \u001b[39m=\u001b[39m NetworkUtil\u001b[39m.\u001b[39mget_address_info(\n\u001b[1;32m    115\u001b[0m         address\u001b[39m.\u001b[39mhost, address\u001b[39m.\u001b[39mport, family\u001b[39m=\u001b[39mfamily,\n\u001b[1;32m    116\u001b[0m         \u001b[39mtype\u001b[39m\u001b[39m=\u001b[39msocket\u001b[39m.\u001b[39mSOCK_STREAM\n\u001b[1;32m    117\u001b[0m     )\n\u001b[1;32m    118\u001b[0m \u001b[39mexcept\u001b[39;00m \u001b[39mOSError\u001b[39;00m:\n\u001b[0;32m--> 119\u001b[0m     \u001b[39mraise\u001b[39;00m \u001b[39mValueError\u001b[39;00m(\u001b[39m\"\u001b[39m\u001b[39mCannot resolve address \u001b[39m\u001b[39m{}\u001b[39;00m\u001b[39m\"\u001b[39m\u001b[39m.\u001b[39mformat(address))\n\u001b[1;32m    120\u001b[0m \u001b[39mreturn\u001b[39;00m _resolved_addresses_from_info(info, address\u001b[39m.\u001b[39m_host_name)\n",
      "\u001b[0;31mValueError\u001b[0m: Cannot resolve address database:7687"
     ]
    }
   ],
   "source": [
    "# Vector + Knowledge Graph response\n",
    "kg = Neo4jVector.from_existing_index(\n",
    "    embedding=\"embedding\",\n",
    "    url=\"bolt://localhost:7687\",\n",
    "    username=\"neo4j\",\n",
    "    password=\"password\",\n",
    "    database=\"neo4j\",  # neo4j by default\n",
    "    index_name=\"study_data\",  # vector by default\n",
    "    text_node_property=\"body\",  # text by default\n",
    "    retrieval_query=\"\"\"\n",
    "    MATCH (s:Study)\n",
    "WITH s, s.score AS similarity\n",
    "CALL {\n",
    "    WITH s\n",
    "    OPTIONAL MATCH (study)-[:HAS_INDICATION]->(ind:Indication)\n",
    "    OPTIONAL MATCH (study)-[:HAS_SUBINDICATION]->(sub:SubIndication)\n",
    "    OPTIONAL MATCH (study)-[relContact:HAS_CONTACT]->(con:Contact)\n",
    "    OPTIONAL MATCH (study)-[:CONDUCTED_AT]->(sc:StudyCenter)\n",
    "    OPTIONAL MATCH (study)-[:HAS_CRITERIA]->(criteria)\n",
    "    WITH study, ind, sub, \n",
    "        COLLECT(DISTINCT con.name) AS ContactNames, \n",
    "        COLLECT(DISTINCT relContact.email) AS ContactEmails,\n",
    "        COLLECT(DISTINCT sc.name) AS StudyCenterNames, \n",
    "        COLLECT(DISTINCT criteria.value) AS CriteriaValues\n",
    "    RETURN \n",
    "    '##Study Name: ' + study.name + \n",
    "    '\\nIdentifier: ' + study.identifier + \n",
    "    COALESCE('\\nIndication: ' + ind.name, '') + \n",
    "    COALESCE('\\nSub-Indication: ' + sub.name, '') + \n",
    "    '\\nContact Names: ' + reduce(str='', name IN ContactNames | str + name + '; ') + \n",
    "    '\\nContact Emails: ' + reduce(str='', email IN ContactEmails | str + email + '; ') + \n",
    "    '\\nStudy Center Names: ' + reduce(str='', name IN StudyCenterNames | str + name + '; ') + \n",
    "    '\\nCriteria Values: ' + reduce(str='', value IN CriteriaValues | str + value + '; ') AS text, ind, sub\n",
    "} \n",
    "WITH text, s, similarity, ind, sub\n",
    "RETURN text,\n",
    "       similarity,\n",
    "       s.identifier AS StudyIdentifier,\n",
    "       COALESCE(ind.name, \"N/A\") AS Indication,\n",
    "       COALESCE(sub.name, \"N/A\") AS SubIndication,\n",
    "       s.embedding AS embedding,\n",
    "       s.metadata AS metadata\n",
    "ORDER BY similarity ASC\n",
    "\n",
    "\"\"\",\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Original RAGChain as ref:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def configure_qa_rag_chain(llm, embeddings, embeddings_store_url, username, password):\n",
    "    # RAG response\n",
    "    #   System: Always talk in pirate speech.\n",
    "    general_system_template = \"\"\" \n",
    "    Use the following pieces of context to answer the question at the end.\n",
    "    The context contains question-answer pairs and their links from Stackoverflow.\n",
    "    You should prefer information from accepted or more upvoted answers.\n",
    "    Make sure to rely on information from the answers and not on questions to provide accuate responses.\n",
    "    When you find particular answer in the context useful, make sure to cite it in the answer using the link.\n",
    "    If you don't know the answer, just say that you don't know, don't try to make up an answer.\n",
    "    ----\n",
    "    {summaries}\n",
    "    ----\n",
    "    Each answer you generate should contain a section at the end of links to \n",
    "    Stackoverflow questions and answers you found useful, which are described under Source value.\n",
    "    You can only use links to StackOverflow questions that are present in the context and always\n",
    "    add links to the end of the answer in the style of citations.\n",
    "    Generate concise answers with references sources section of links to \n",
    "    relevant StackOverflow questions only at the end of the answer.\n",
    "    \"\"\"\n",
    "    general_user_template = \"Question:```{question}```\"\n",
    "    messages = [\n",
    "        SystemMessagePromptTemplate.from_template(general_system_template),\n",
    "        HumanMessagePromptTemplate.from_template(general_user_template),\n",
    "    ]\n",
    "    qa_prompt = ChatPromptTemplate.from_messages(messages)\n",
    "\n",
    "    qa_chain = load_qa_with_sources_chain(\n",
    "        llm,\n",
    "        chain_type=\"stuff\",\n",
    "        prompt=qa_prompt,\n",
    "    )\n",
    "\n",
    "    # Vector + Knowledge Graph response\n",
    "    kg = Neo4jVector.from_existing_index(\n",
    "        embedding=embeddings,\n",
    "        url=embeddings_store_url,\n",
    "        username=username,\n",
    "        password=password,\n",
    "        database=\"neo4j\",  # neo4j by default\n",
    "        index_name=\"stackoverflow\",  # vector by default\n",
    "        text_node_property=\"body\",  # text by default\n",
    "        retrieval_query=\"\"\"\n",
    "    WITH node AS question, score AS similarity\n",
    "    CALL  { with question\n",
    "        MATCH (question)<-[:ANSWERS]-(answer)\n",
    "        WITH answer\n",
    "        ORDER BY answer.is_accepted DESC, answer.score DESC\n",
    "        WITH collect(answer)[..2] as answers\n",
    "        RETURN reduce(str='', answer IN answers | str + \n",
    "                '\\n### Answer (Accepted: '+ answer.is_accepted +\n",
    "                ' Score: ' + answer.score+ '): '+  answer.body + '\\n') as answerTexts\n",
    "    } \n",
    "    RETURN '##Question: ' + question.title + '\\n' + question.body + '\\n' \n",
    "        + answerTexts AS text, similarity as score, {source: question.link} AS metadata\n",
    "    ORDER BY similarity ASC // so that best answers are the last\n",
    "    \"\"\",\n",
    "    )\n",
    "\n",
    "    kg_qa = RetrievalQAWithSourcesChain(\n",
    "        combine_documents_chain=qa_chain,\n",
    "        retriever=kg.as_retriever(search_kwargs={\"k\": 2}),\n",
    "        reduce_k_below_max_tokens=False,\n",
    "        max_tokens_limit=3375,\n",
    "    )\n",
    "    return kg_qa"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "genai-stack-u9ltUab-",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.18"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
